1.在多线程环境中，Python 虚拟机按有几种执行方式?
pyton多线程严格来说并不是真正的多线程，而是基于GIL全局解释锁进行上下文切换。
线程1，GIL锁定，执行100k 解锁线程1 切到到线程2.GIL锁定，执行100k
就是重复上边的操作。
python的话建议用协程,gevent第三方不错。协程是基于程序级的代码级切换，本身有自己的寄存器。进行上下文切换。 本身只占一个线程。但是只能利用一个cpu核。如果要高性能历用。一般会采用多进程+协程。

2.ipython notebook是什么
一个 web版的 python 开发 IDE

3.现在python用什么版本
根据python官方声明，python2版本2020年将不再支持维护，所以建议使用python3版本，python3系列中python3.6以上版本较为稳定。

4.python多行注释是什么
''' 多行注释，用三个单引号 多行注释，用三个单引号 ''' """ 多行注释，用三个双引号 多行注释，用三个双引号 """

5.cmd怎么装python模块
打开 cmd终端->输入pip install xxx->pip search xxx 

6.cookie 和session 的区别？
1、cookie数据存放在客户的浏览器上，session数据放在服务器上。

2、cookie不是很安全，别人可以分析存放在本地的COOKIE并进行COOKIE欺骗考虑到安全应当使用session。

3、session会在一定时间内保存在服务器上。当访问增多，会比较占用服务器的性能考虑到减轻服务器性能方面，应当使用COOKIE。

4、单个cookie保存的数据不能超过4K，很多浏览器都限制一个站点最多保存20个cookie。

5、建议： 将登陆信息等重要信息存放为SESSION 其他信息如果需要保留，可以放在COOKIE中


7.线上服务可能因为种种原因导致挂掉怎么办？
linux下的后台进程管理利器 supervisor

8.如何提高python的运行效率
使用生成器；关键代码使用外部功能包（Cython，pylnlne，pypy，pyrex）；针对循环的优化--尽量避免在循环中访问变量的属性

9.如果对方网站反爬取，封IP了怎么办？
放慢抓取熟速度，减小对目标网站造成的压力，但是这样会减少单位时间内的数据抓取量 /使用代理IP 

10.Python 中的注释有几种？
总体来说分为两种，单行注释和多行注释。
单行注释在行首是 #。
多行注释可以使用三个单引号或三个双引号，包括要注释的内容。

11.robots协议是什么？
Robots协议（也称为爬虫协议、爬虫规则、机器人协议等）也就是robots.txt，网站通过robots协议告诉搜索引擎哪些页面可以抓取，哪些页面不能抓取。

Robots协议是网站国际互联网界通行的道德规范，其目的是保护网站数据和敏感信息、确保用户个人信息和隐私不被侵犯。因其不是命令，故需要搜索引擎自觉遵守。

12.为什么 requests 请求需要带上 header？
模拟浏览器，欺骗服务器，获取和浏览器一致的内容
header 的形式：字典 用法： requests.get(url,headers=headers)

13.写一个邮箱地址的正则表达式？
[A-Za-z0-9\u4e00-\u9fa5]+@[a-zA-Z0-9_-]+(.[a-zA-Z0-9_-]+)+$

14.urllib 和 urllib2 的区别？
urllib 和urllib2都是接受URL请求的相关模块，但是urllib2可以接受一个Request类的实例来设置URL请求的headers，urllib仅可以接受URL。





